Reports/Лео_ОтчетОРентабельностиПродажВСравненииСРПЛ/Лео_ОтчетОРентабельностиПродажВСравненииСРПЛ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>Лео_ОтчетОРентабельностиПродажВСравненииСРПЛ</name>
  <attributes>
    <name>ДатаС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрайсЛистБазовойВыручки</name>
    <type>
      <types>CatalogRef.ТипыЦенНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрайсЛистСебестоимости</name>
    <type>
      <types>CatalogRef.ТипыЦенНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>ValueList</types>
    </type>
  </attributes>
  <attributes>
    <name>Отдел</name>
    <type>
      <types>ValueList</types>
    </type>
  </attributes>
  <attributes>
    <name>БизнесРегион</name>
    <type>
      <types>ValueList</types>
    </type>
  </attributes>
  <attributes>
    <name>Канал</name>
    <type>
      <types>CatalogRef.ЗначенияСвойствОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипГруппировки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Результат</name>
    <type>
      <types>SpreadsheetDocument</types>
    </type>
  </attributes>
</mdclass:Report>

Reports/Лео_ОтчетОРентабельностиПродажВСравненииСРПЛ/Forms/ФормаОтчета/Module.bsl
&НаКлиенте
Процедура ТипГруппировкиПриИзменении(Элемент)

	Элементы.БизнесРегион.Видимость = Отчет.ТипГруппировки =	"БизнесРегион" ;
	Элементы.Контрагент.Видимость = Отчет.ТипГруппировки =	"Контрагент" ;
	Элементы.Канал.Видимость = Отчет.ТипГруппировки =	"Канал" ;
	Элементы.Отдел.Видимость = Отчет.ТипГруппировки =	"Отдел" ;
	Отчет.БизнесРегион.Очистить();
	Отчет.Отдел.Очистить();
	Отчет.Контрагент.Очистить();
	Отчет.Канал = Справочники.ЗначенияСвойствОбъектов.ПустаяСсылка();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Отчет.ТипГруппировки =	"Контрагент";	
	
	Элементы.БизнесРегион.Видимость = Отчет.ТипГруппировки =	"БизнесРегион" ;
	Элементы.Контрагент.Видимость = Отчет.ТипГруппировки =	"Контрагент" ;
	Элементы.Канал.Видимость = Отчет.ТипГруппировки =	"Канал" ;
	Элементы.Отдел.Видимость = Отчет.ТипГруппировки =	"Отдел" ;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	Элементы.Результат.ОтображатьЗаголовки = Истина;
	СформироватьСервер();
	//Элементы.Результат.ФиксацияСлева = 3;
    Элементы.Результат.ФиксацияВТаблице = ФиксацияВТаблице.Лево
КонецПроцедуры


&НаСервере
Процедура СформироватьСервер()
	
	ТекОбъект = РеквизитФормыВЗначение("Отчет");
	ТекОбъект.СформироватьОтчет();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТипыСписка = "СправочникСсылка.Контрагенты";
  	ДоступныеТипы = Новый ОписаниеТипов(ТипыСписка);
    Отчет.Контрагент.ТипЗначения = ДоступныеТипы;
		
	ТипыСписка = "СправочникСсылка.Регионы";
  	ДоступныеТипы = Новый ОписаниеТипов(ТипыСписка);
    Отчет.БизнесРегион.ТипЗначения = ДоступныеТипы;
	Отчет.Отдел.ТипЗначения = ДоступныеТипы;	
КонецПроцедуры
